УТ/src/Catalogs/CRM_ДействияЯзыковыхМоделей/CRM_ДействияЯзыковыхМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ДействияЯзыковыхМоделей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВыделиГлавное</name>
      <description>Выдели главное</description>
    </items>
    <items>
      <name>ИзмениТекст</name>
      <description>Измени текст</description>
    </items>
    <items>
      <name>Объясни</name>
      <description>Объясни</description>
    </items>
    <items>
      <name>ОтветьНаВопрос</name>
      <description>Ответь на вопрос</description>
    </items>
    <items>
      <name>Переведи</name>
      <description>Переведи</description>
    </items>
    <items>
      <name>СвойЗапрос</name>
      <description>Свой запрос</description>
    </items>
    <items>
      <name>СтильТекста</name>
      <description>Стиль текста</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетТекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйПромпт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Иконка</name>
    <comment>Имя картинки из библиотеки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ДействияЯзыковыхМоделей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенныеЭлементы(Элемент = Неопределено) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДействияЯзыковыхМоделей.Ссылка КАК Ссылка,
	                      |	CRM_ДействияЯзыковыхМоделей.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	                      |ИЗ
	                      |	Справочник.CRM_ДействияЯзыковыхМоделей КАК CRM_ДействияЯзыковыхМоделей
	                      |ГДЕ
	                      |	НЕ CRM_ДействияЯзыковыхМоделей.ЭтоГруппа
	                      |	И CRM_ДействияЯзыковыхМоделей.Предопределенный
	                      |	И ИСТИНА");
	
	Если Элемент <> Неопределено Тогда
		Если Элемент.ЭтоГруппа Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "CRM_ДействияЯзыковыхМоделей.Родитель = &Родитель");
			Запрос.УстановитьПараметр("Родитель", Элемент);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "CRM_ДействияЯзыковыхМоделей.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Элемент);
		КонецЕсли;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок = ПолучитьМакет("ПредопределенныеПромпты");
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область(1, 1,
		 ТабДок.ВысотаТаблицы,
		 ТабДок.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаДанных = Построитель.Результат.Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		Строка = ТаблицаДанных.Найти(Выборка.ИмяПредопределенныхДанных, "ИмяПредопределенного");
		Если Строка <> Неопределено Тогда
			Действие = Выборка.Ссылка.ПолучитьОбъект();
			Действие.СистемныйПромпт = Строка.СистемныйПромпт;
			Действие.ИзменяетТекст = Строка.ИзменяетТекст;
			Действие.Используется = Истина;
			Действие.Иконка = Строка.Иконка;
			Если Действие.РеквизитДопУпорядочивания = 0 Тогда
				Действие.РеквизитДопУпорядочивания = Число(Действие.Код);
			КонецЕсли;
			Действие.Записать();
		КонецЕсли;
	КонецЦикла
	
КонецПроцедуры

Функция ПромптПредопределенного(ИмяПредопределенного) Экспорт

	ТабДок = ПолучитьМакет("ПредопределенныеПромпты");
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область(1, 1,
		 ТабДок.ВысотаТаблицы,
		 ТабДок.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаДанных = Построитель.Результат.Выгрузить();

	Строка = ТаблицаДанных.Найти(ИмяПредопределенного, "ИмяПредопределенного");
	Если Строка <> Неопределено Тогда
		Возврат Строка.СистемныйПромпт;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
